Revit 2026 API
ThermalProperties Properties
The ThermalProperties type exposes the following members.
Properties
Name | Description
Absorptance |  Value of absorptance.
HeatTransferCoefficient |  The heat transfer coefficient value (U-Value). The unit is watts per meter-squared kelvin (W/(m^2*K)).
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Roughness |  Value of roughness.
ThermalMass |  The calculated thermal mass value. The unit is kilogram feet-squared per second squared kelvin (kg ft^2/(s^2 K)).
ThermalResistance |  The calculated thermal resistance value (R-Value). The unit is meter-squared kelvin per watt ((m^2*K)/Watt).
Top
See Also
Reference
ThermalProperties Class
Autodesk.Revit.DB Namespace